burning_airlines_server/app/views/flights/_form.html.erb

SELECT "planes"."name", "planes"."id" FROM "planes"
---
    <%= form.label :plane_id %>
    <%= form.select :plane_id, Plane.pluck(:name, :id)  %>