burning_airlines_server/app/controllers/flights_controller.rb

  def index
    @flights = Flight.all
---
SELECT "flights".* FROM "flights" ORDER BY created_at DESC

  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save
---
INSERT INTO "flights" ("flight_name", "origin", "destination", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["flight_name", "jfeof"], ["origin", "erf"], ["destination", "ff"], ["date", "2018-07-31"], ["created_at", "2018-07-31 06:54:01.398873"], ["updated_at", "2018-07-31 06:54:01.398873"]]

  def update
    respond_to do |format|
      if @flight.update(flight_params)
---
UPDATE "flights" SET "plane_id" = $1, "updated_at" = $2 WHERE "flights"."id" = $3  [["plane_id", 566], ["updated_at", "2018-07-31 05:49:33.879590"], ["id", 2]]

  def destroy
    @flight.destroy
---
DELETE FROM "flights" WHERE "flights"."id" = $1  [["id", 1]]