burning_airlines_server/app/controllers/planes_controller.rb

SELECT "planes".* FROM "planes"
---
  def index
    @planes = Plane.all

INSERT INTO "planes" ("name", "row", "column", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "747"], ["row", 21], ["column", "A B C D"], ["created_at", "2018-08-01 01:16:23.971607"], ["updated_at", "2018-08-01 01:16:23.971607"]]
---
  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save

SELECT  "planes".* FROM "planes" WHERE "planes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_plane
      @plane = Plane.find(params[:id])