burning_airlines_server/app/controllers/reservations_controller.rb

INSERT INTO "reservations" ("flight_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["flight_id", 1], ["user_id", 4], ["created_at", "2018-08-01 00:28:02.984418"], ["updated_at", "2018-08-01 00:28:02.984418"]]
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save